docs: replace ascii diagram with mermaid
